{"568": ["IT Consultis - Senior iOS Application Developer - Saigon - FT", "Jun 1, 2017", "https://github.com/awesome-jobs/vietnam/issues/568", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Saigon, Vietnam</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>From 900 to 1800 USD/month</li>\n</ul>\n<h2>Requirement</h2>\n<ul>\n<li>Bachelor&rsquo;s Degree in Computer Science or equivalent experience in the software development field</li>\n<li>5+ years of software development experience with a minimum of 3+ years mobile application development experience</li>\n<li>Disciplined approach to software development. Includes defining and enforcing engineering best practices</li>\n<li>Experience reviewing and updating requirements and/or user stories</li>\n<li>Experience writing technical documentation</li>\n<li>Understanding of agile software development</li>\n</ul>\n<h2>Skills</h2>\n<h3>Must have</h3>\n<ul>\n<li>Expert knowledge of Swift, Objective-C, X-Code IDE</li>\n<li>Adept at building beautiful interfaces in concert with a strong, working understanding of data model management</li>\n<li>Experience in developing applications leveraging XML/JSON</li>\n<li>Familiar with Cocoa Touch and Reactive Cocoa</li>\n<li>Solid understanding of Data Modeling</li>\n<li>Solid understand of Multi-Threaded applications</li>\n<li>Have published one or more iOS apps in the App Store</li>\n<li>Strong technical, problem-solving, analytical, communication and interpersonal skills</li>\n<li>Demonstrated ability to work on diverse projects requiring detailed analysis, creative/practical problem solving, time management and logical judgment</li>\n<li>Familiar with iOS design guidelines and best practices</li>\n<li>Understanding of importance of maintainable / sustainable product solutions</li>\n<li>Experience working with iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text</li>\n<li>Experience in working with third-party libraries and APIs</li>\n<li>Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies</li>\n<li>Solid understanding of the full mobile development life cycle</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>A working knowledge of JavaScript and WEB 2.0 applied in the context of Hybrid mobile development using frameworks such as PhoneGap or Cordova is big nice-to-have.</li>\n<li>Knowledge in web technologies such as HTML5 / CSS / JavaScript is an advantage</li>\n<li>Understanding of Automated testing</li>\n<li>Well-versed and active user of GitHub</li>\n</ul>\n<h3>Responsibilities</h3>\n<p>You will be:</p>\n<ul>\n<li>Accountable for designing and building advanced applications for the iOS platform</li>\n<li>Leading team to deliver and execute on a project</li>\n<li>Analyzing user stories and participating in sprint planning, scrums, demos and retrospectives</li>\n<li>Accountable for uptime and high-availability for all solutions</li>\n<li>Accountable for performance and usability in all solutions</li>\n<li>Accountable for working with outside data sources and APIs</li>\n<li>Coordinating with Architect team on new designs and foundational / infrastructural application changes</li>\n<li>Collaborating with cross-functional teams to define, design, and ship new features</li>\n<li>Integrating mobile application code with back-end services</li>\n<li>Understanding the need for optimized / customized mobile service responses / payloads</li>\n<li>Accountable for Unit-test code for robustness, including edge cases, usability, and general reliability</li>\n<li>Accountable for working on bug fixing and improving application performance</li>\n<li>Ensuring the performance, quality, and responsiveness of applications</li>\n<li>Accountable for maintaining code quality, organization and automatization</li>\n<li>Accountable for continuously discovering, evaluating, and implementing new technologies to optimize development efficiency</li>\n<li>Performing peer code reviews for immediate and related teams</li>\n<li>Understanding of continuous integration / continuous delivery concepts and the ability to troubleshoot related issues</li>\n<li>Assisting the QA team with new product releases and bug fixes for products</li>\n<li>Providing architectural direction on behalf of the architect team</li>\n<li>Providing estimates for new initiatives</li>\n<li>Communicating long-term technical strategies to the group</li>\n</ul>\n<h3>You can bring:</h3>\n<ul>\n<li>Excellent written, verbal and interpersonal English communication skills. The position requires frequent communication with colleagues and in several different geographic locations and time zones</li>\n<li>Proven ability to work with all members of an extended and diverse project team</li>\n<li>Must be detail-oriented, self-organized, be committed to quality and be capable of tracking multiple issues simultaneously</li>\n<li>Capability of mentoring and guidance skills to provide oversight and direction to contractors and junior members of the team</li>\n<li>Excellent time management skills</li>\n<li>Confidence and ability to perform effectively and make decisions with minimal management oversight</li>\n<li>Ability and desire to effectively mentor others and contribute to a collaborative team environment</li>\n</ul>\n<h3>Why it would be awesome to work with us:</h3>\n<ul>\n<li>ITC welcome package</li>\n<li>ITC athlete program</li>\n<li>Soft skills improvements</li>\n<li>Expert sharing sessions</li>\n<li>Career development and evolution</li>\n<li>Onboarding and mentoring</li>\n</ul>\n<h3>Interesting Engineering Projects:</h3>\n<ul>\n<li>New mobile app and already leading the market in Shanghai and ready to scale up globally! The ground-breaking App focuses on bringing a community of fashion lovers together. Users get inspirations from the community about outfits. They can also improve their own style and receive or give feedback to others.</li>\n<li>Working on this project is a fantastic opportunity to participate in something that will be one of the new unicorns.</li>\n</ul>\n<h3>Contact:</h3>\n<ul>\n<li>Homepage: <a href=\"https://it-consultis.com\">https://it-consultis.com</a></li>\n<li>Email: <a href=\"mailto:ninh.nguyen@it-consultis.com\">ninh.nguyen@it-consultis.com</a></li>\n</ul>\n          </td>\n        </tr>\n      </tbody>\n    "], "603": ["LARION - Business Analyst Internship - Saigon - PT/FT", "Jul 4, 2017", "https://github.com/awesome-jobs/vietnam/issues/603", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Hall 5, Quang Trung Software City, Tan Chanh Hiep Ward, District 12, HCMC</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>2,000,000 VND/month</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Excellence in English (written and verbal skills)</li>\n<li>Have a strong passion in communicating with customer</li>\n</ul>\n<h2>Skills</h2>\n<ul>\n<li>Business Analyst</li>\n</ul>\n<h3>Must Have</h3>\n<ul>\n<li>Excellent in English (written and verbal skills)</li>\n<li>Good presentation and documentation skills</li>\n<li>Enthusiastic and supportive team-player, reliable and responsible</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Gather business and system requirements from client</li>\n<li>Communicate with customers to clarify any unclear information about the business requirements</li>\n<li>Analyze and specify requirements, synthesize information provided by relevant stakeholders</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>Salary</li>\n<li>Lunch &amp; parking free</li>\n<li>On-the-job training</li>\n<li>Learn both soft and technical skills</li>\n<li>Develop a long-term career path with LARION</li>\n</ul>\n<h3>Interesting Engineering Projects</h3>\n<p>Our wide range of services includes:</p>\n<ul>\n<li>Ruby on Rails Web Application Development</li>\n<li>Big Data &ndash; Data Analytics especially in Healthcare</li>\n<li>Supply Chain Management Application Development</li>\n<li>Social E-commerce App Development</li>\n<li>Securities Trading Solutions Development</li>\n<li>SurroundCore Banking Solutions Development</li>\n</ul>\n<h3>Contact</h3>\n<p>Email: <a href=\"mailto:recruitment@elarion.com\">recruitment@elarion.com</a></p>\n          </td>\n        </tr>\n      </tbody>\n    "], "574": ["LARION - Senior .NET/C#/JS Developer ($1600 ~ $2000) - Saigon - FT", "Jun 6, 2017", "https://github.com/awesome-jobs/vietnam/issues/574", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Hall 5, Quang Trung Software City, Tan Chanh Hiep Ward, District 12, HCMC</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>$1600 ~ $2000</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Good communication skill in Japanese (N3~N1)</li>\n<li>At leat 2 year experience in developing .NET, C#, Java Script, MS Excel</li>\n<li>Working experience in object oriented programming</li>\n<li>Good knowledge of SQL / SQL Server (relational database)</li>\n<li>Good decision making and time management skills</li>\n<li>Be proactive, creative and positive attitude at work</li>\n<li>Willing to adapt and to take advantage of new technologies and market shifts</li>\n</ul>\n<h2>Skills</h2>\n<ul>\n<li>.NET, C#, Javascript</li>\n<li>Japanese at least N3</li>\n</ul>\n<h3>Must Have</h3>\n<ul>\n<li>Good communication skill in Japanese (N3~N1)</li>\n<li>At leat 2 year experience in developing .NET, C#, Java Script, MS Excel</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Directly working with Japanese-speaking stakeholders to gather business and system requirement. Become the hub of development and communication in the team</li>\n<li>Analyze client requirements to develop functional and technical software requirements</li>\n<li>Produce a solid and detailed technical design documents</li>\n<li>Write clean, modular, robust code to implement the desired requirements</li>\n<li>Conduct code re-factoring, optimization. Maintain efficient, reusable, and reliable source code</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>Attractive salary and benefits (13th salary, distinguised employee of the quater and year, seniority award...)</li>\n<li>Performance appraisal twice a year</li>\n<li>Healthcare and accident insurance</li>\n<li>Various training on best practices and soft skills</li>\n<li>Teambuilding activities in every summer, company trip, big annual year-end party every year, etc.<br/>\nFitness &amp; sports activities: football, tennis, table-tennis, badminton...</li>\n<li>Commitment to community development: charity every quarter, blood donation, public seminars, career orientation talks&hellip;</li>\n<li>Free in-house entertainment facilities (foodball, table tennis, boxing, coffee...)</li>\n<li>Support for personal loans such as: home loan, vehicle loan, tuition fee...</li>\n</ul>\n<h3>Interesting Engineering Projects</h3>\n<p>Our wide range of services includes:</p>\n<ul>\n<li>Ruby on Rails Web Application Development</li>\n<li>Big Data &ndash; Data Analytics especially in Healthcare</li>\n<li>Supply Chain Management Application Development</li>\n<li>Social E-commerce App Development</li>\n<li>Securities Trading Solutions Development</li>\n<li>SurroundCore Banking Solutions Development</li>\n</ul>\n<h3>Contact</h3>\n<p>Email: <a href=\"mailto:recruitment@elarion.com\">recruitment@elarion.com</a></p>\n          </td>\n        </tr>\n      </tbody>\n    "], "604": ["hasBrain - ReactJS Developer (Junior/Senior) - Saigon - FT", "Jul 4, 2017", "https://github.com/awesome-jobs/vietnam/issues/604", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Saigon Pearl, 92 Nguyen Huu Canh, Ward 22, Binh Thanh District, HCMC, Vietnam</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>Negotiate</li>\n</ul>\n<h2>Job Description</h2>\n<ul>\n<li>We are looking for a Senior/Junior frontend (React.JS) developer responsible for the development and maintenance of applications aimed at a range of web services including mobile optimized web applications. Your primary focus will be the development of frontend and their integration with back-end services.</li>\n<li>You must be a team player, while also having the motivation and drive to work independently. You must possess a strong desire for producing high-quality work and the ability to iterate and execute ideas swiftly with minimal direction.</li>\n<li>You will own the technical implementation of projects and will be expected to provide training, guidance, and mentorship to other members of the team. This role is expected to guide decisions on technical strategy, architecture, best practices, tools, and utilities. This is a hands-on engineering position that requires expert level proficiency in Javascript and various frontend frameworks.<br/>\nYou will report directly to the CEO and will be responsible for one or multiple web apps, including design, architecture, development, and testing.</li>\n</ul>\n<h2>Skills</h2>\n<ul>\n<li>Experience in ReactJS or equivalent experience in other JS front end frameworks with an interest in ReactJS</li>\n<li>Expert knowledge and strong command of common web front-end technologies (HTML5, CSS3, JavaScript, Ajax, and jQuery/Dojo/YUI) and design patterns</li>\n<li>Knowledge of test-driven development, and usage of tools such as Selenium, Jasmine, or Karma</li>\n<li>Experience with modern JS frameworks such as React, Backbone, Vue or Angular and CSS grids: JQuery, TWBootstrap, Webpack</li>\n<li>Familiar with modern javascript development ecosystem such as node.js, grunt, gulp, bower, browserify, babel, etc.</li>\n<li>Experience in database systems such as Postgres, MySQL, MSSQL</li>\n<li>Extensive experience in Web Accessibility, technical Search Engine Optimization (SEO)</li>\n<li>Knowledge in front end performance optimization</li>\n<li>Experience in writing complex Single Page Applications</li>\n<li>Must demonstrate solid organization/communication skills</li>\n<li>Care about quality and you know what it means to ship high quality code.</li>\n</ul>\n<h3>Ideally( Optional)</h3>\n<ul>\n<li>Experience with AngularJS (Advanced/Expert)</li>\n<li>Experience with React + Redux</li>\n<li>Some experience of server-side programming with Node JS is a plus</li>\n<li>Product design experience with focus on user analytics and UI/UX standards</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Ensure the best possible performance, quality, and responsiveness of the application</li>\n<li>Design, build, and maintain high performance, reusable, and reliable code for the web platform</li>\n<li>Help maintain code quality, organization, and automatization</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features</li>\n<li>Collaborate with back-end developers for integration with server-side code.</li>\n<li>Ensure the technical feasibility of UI/UX designs</li>\n<li>Perform unit and system test to ensure code robustness, including edge cases, usability, and general reliability</li>\n<li>Continuously discover, evaluate, and implement new technologies to maximize development efficiency</li>\n<li>Use Trello to organize your work and report your progress clearly and on a periodic basis to the senior leadership team</li>\n<li>Use agile methodologies to meet the project deliverables on schedule</li>\n<li>Release fast and agile, in two-week sprints</li>\n<li>Guide decisions on architecture and technical strategy</li>\n<li>Research, test, and implement market leading techniques, tools, frameworks, and utilities</li>\n<li>Adapt to user feedback and optimizing our feature set</li>\n<li>Break old architecture and building for speed and scale</li>\n</ul>\n<h3>You can bring</h3>\n<ul>\n<li>Meticulous</li>\n<li>Positive attitude with a hunger for learning</li>\n<li>Ability to self-study and research, willing to learn attitude</li>\n<li>Like to work in an agile development environment</li>\n<li>Self-driven and able work well in a team</li>\n<li>Ability to work in areas outside of their usual comfort zone and get things done quickly</li>\n<li>\"Do what it takes\" attitude is critical</li>\n<li>Good verbal and written English communications skills and demonstrated experience in presenting details and resolving differences across a variety of tasks.</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>Work with a product driven team of founders and developers directly to drive change</li>\n<li>Be exposed to our users to see the change and value you are bringing to society</li>\n<li>Meet and learn from experienced entrepreneurs. Be part of an experienced team that sets out to create positive social impact</li>\n<li>International exposure. We are a result-driven international team. The core team worked in Silicon Valley, Singapore, Hong Kong, New Zealand and you can expect the culture to be built on trust and results</li>\n<li>Freedom and flexibility. In terms of work hours, responsibility and autonomy, you get to decide what works best for you. Usually between 9.00 am and 6.00 pm on Monday to Friday. And it can be flexible, we don&rsquo;t measure your success by the number of office hours</li>\n<li>Further benefits including flights, training, and other living expenses while training, exchanging with other teams and liaising with clients</li>\n<li>Homey office in Binh Thanh District including breakfast and lunch</li>\n<li>14 days of annual leave, 14 days of medical leave, and public holidays in Vietnam</li>\n<li>No dress code. It&rsquo;s your choice to be confident and comfortable</li>\n<li>Pantry area with snacks, beer, and other beverages.</li>\n</ul>\n<h3>Interested?</h3>\n<p>Homepage: <a href=\"http://www.hasbrain.com/\">http://www.hasbrain.com/</a><br/>\nMaster your crafts and make impacts with us by emailing the below to <a href=\"mailto:linh@hasbrain.com\">linh@hasbrain.com</a></p>\n<ul>\n<li>CV (no more than 2 pages with relevant experiences. Just keep this simple)</li>\n<li>We do not need a cover letter, just two sentences to sum up yourself</li>\n<li>For shortlisted candidates, be prepared for a short interview on Skype followed by a round at our office.</li>\n</ul>\n          </td>\n        </tr>\n      </tbody>\n    "], "543": ["Giao Hang Nhanh - DevOps Engineer - HCM - FT", "May 18, 2017", "https://github.com/awesome-jobs/vietnam/issues/543", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <p>Giao Hang Nhanh is a five-year-old delivery company with more than 3,000 employees focusing on using technologies to solve problems and optimize cost in logistics. We provide hybrid logistics solutions including GHN Express for traditional delivering and AhaMove for on-demand delivering. We believe technology can help people send and receive goods more quickly, more conveniently and more economically with better experience.</p>\n<h3>Location</h3>\n<ul>\n<li>Saigon, Vietnam</li>\n</ul>\n<h3>Salary Expectation</h3>\n<ul>\n<li>Negotiable</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor degree in Computer Science, Software Engineering or Computer Engineering.</li>\n<li>2+ years of experience of System Administration and/or DevOps.</li>\n<li>Strong Linux administration skills.</li>\n<li>Experience with containerized services such as Docker, Kubernetes, etc.</li>\n</ul>\n<h3>Must have</h3>\n<ul>\n<li>Strong administration skills.</li>\n<li>Responsibility, careful, integrity.</li>\n<li>Communication directly and honestly.</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Automating and managing the deployment processes using Continuous Integration and Continuous Delivery techniques.</li>\n<li>Deliver system management tooling to the engineering teams.</li>\n<li>Manage servers, applications and all internal software used by the company.</li>\n<li>Monitor system performance and undertake needed performance tuning.</li>\n<li>Document the configuration of the system infrastructure.</li>\n<li>Able to attend to system alerts on an on-call basis.</li>\n<li>Be an advocate for engineering best practices internally and externally.</li>\n</ul>\n<h3>Interesting Engineering Projects</h3>\n<ul>\n<li>Scale up to hundreds of thousands active clients in Vietnam.</li>\n<li>Band-width, performance monitoring and optimizing for high-latency networks.</li>\n</ul>\n<h3>We offer</h3>\n<ul>\n<li>Competitive salary and participation in our equity incentive program.</li>\n<li>13th-month salary and opportunity for performance bonus.</li>\n<li>Healthcare Insurance.</li>\n<li>Others: open workspace, happy hours, company trips, etc.</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>Become core members of a new platform with the ability to scale to hundred thousands of stations, millions of users and transactions in Vietnam and SEA in next few years.</li>\n<li>Work with a talented team and lots of challenges in logistics solutions.</li>\n</ul>\n<h3>Contact</h3>\n<ul>\n<li>Homepage: <a href=\"https://career.ghn.vn/software-engineer/\">career.ghn.vn</a></li>\n<li><a href=\"mailto:vunmq@ghn.vn\">vunmq@ghn.vn</a> (097 999 4814)</li>\n</ul>\n          </td>\n        </tr>\n      </tbody>\n    "], "566": ["Wefit - Mobile Apps Engineer - Hanoi - FT", "May 31, 2017", "https://github.com/awesome-jobs/vietnam/issues/566", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>HaNoi, Vietnam</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>Negotiate</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Have passion in developing products for end user, willing to learn new technology</li>\n<li>Have basic knowledge about ReactNative or at least a mobile developing language (Objective C, Java, etc)</li>\n<li>Having a real product on AppStore or Google Play Store is an advantage</li>\n<li>Familiar with Git</li>\n<li>Have basic Photoshop skill: crop, resize, measure,&hellip;</li>\n</ul>\n<h2>Skills</h2>\n<ul>\n<li>Javascript(ES5, ES6)</li>\n<li>Photoshop</li>\n</ul>\n<h3>Must Have</h3>\n<ul>\n<li>\n<p>Have passion in developing products for end user, willing to learn new technology</p>\n</li>\n<li>\n<p>Javascript(ES5, ES6)</p>\n</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>ReactNative, ios, android</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Build and develop WeFit app on iOS and Android</li>\n<li>Develop reusable and flexible components</li>\n<li>Teamwork with engineering team and UI/UX team</li>\n<li>Attend meetings and contribute ideas for the product</li>\n</ul>\n<h3>Why it would be awesome to work with us (REQUIRED)</h3>\n<ul>\n<li>Being train both in programming and product developing with young dynamic team</li>\n<li>Transparent evaluation process, fast growing salary (15%/year in average)</li>\n<li>Have chance to join ESOP (employee stock ownership plan) every 6 months</li>\n</ul>\n<h3>Interesting Engineering Projects</h3>\n<ul>\n<li>Build flexible components using react native for android, ios platform</li>\n</ul>\n<h3>Contact</h3>\n<p>Homepage: wefit.vn<br/>\nWefit: <a href=\"mailto:anhhth@wefit.vn\">anhhth@wefit.vn</a> (+84 047 304 1155)</p>\n          </td>\n        </tr>\n      </tbody>\n    "], "555": ["CodeLink - Full Stack Developer - HCMC - FT", "May 23, 2017", "https://github.com/awesome-jobs/vietnam/issues/555", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <p><a href=\"https://cloud.githubusercontent.com/assets/122055/26343114/f2a785ca-3fc4-11e7-9a43-a6c9ebaefe9c.jpg\" target=\"_blank\"><img alt=\"codelink-headline-photo-compress\" src=\"https://cloud.githubusercontent.com/assets/122055/26343114/f2a785ca-3fc4-11e7-9a43-a6c9ebaefe9c.jpg\" style=\"max-width:100%;\"/></a></p>\n<h2>Location</h2>\n<p>We are conveniently located on Truong Dinh at the border of District 1 and District 3, with easy access for all districts and a plentiful amount of awesome food and great coffee shops around the office</p>\n<h2>About us</h2>\n<p>CodeLink is an innovative and design focused development studio made up of an international mix of Designers and Developers. We are a self-driven cross-functional team with a unified commitment to user-centric design thinking and extreme programming development methodologies.</p>\n<p>We are dedicated to using the latest cutting edge technologies to help young start-ups launch their products as rapidly as possible, adapting to change and staying ahead of the market.</p>\n<p>We use Rails, Node.js, React and React Native. If you are interested in learning and working with these technologies then come talk with us.</p>\n<h2>Requirements</h2>\n<ul>\n<li>Require minimum of 1 year of experience (mobile, web)</li>\n<li>Require Git, Github and Pull Request knowledge</li>\n<li>Require solid Front-End knowledge in Javascript and/or HTML/CSS</li>\n<li>Require relevant knowledge of relational database systems like PostgreSQL and MySQL</li>\n<li>Familiar with web technologies like REST API, security, performance etc.</li>\n<li>Familiar with deployment, scaling, monitoring and performance tuning</li>\n<li>Familiar with Agile Process and Scrum Methodologies</li>\n<li>Familiar with Extreme Programming methodologies of TDD (Test Driven Development), Refactoring and Continuous Integration</li>\n<li>Strong written and verbal communication skills in English</li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Work on rapidly creating new Web and Mobile products for a diverse range of Clients and industries</li>\n<li>Work and pair with other developers to build applications with Ruby/Node.js and React/React-Native</li>\n<li>Actively involved in product discussions and Sprint Planning</li>\n<li>Work with Product Owner to convert business requirements into technical designs</li>\n<li>Cooperate with UI Designer to implement modern minimalist designs into production</li>\n<li>Learn new languages and frameworks to improve yourself and stay current in an ever-changing environment</li>\n<li>Contribute to the local Tech Ecosystem by mentoring, writing articles and joining events.</li>\n</ul>\n<h2>How we work</h2>\n<p>We work with a true team mindset, with every member having equal say in how we run our projects, our technologies and our product decisions. We work as a tight and unified team, investing in the development of all members of our team and the furthering of their abilities.</p>\n<p>We focus on creating qualified software and on improving our engineers. You are required to write neat code and follow highly efficient workflow, but you are about to learn tons of new things along the way via pair programming, code review and mentorship.</p>\n<h2>Why you&rsquo;ll love working with us</h2>\n<ul>\n<li>Absolutely no overtime.</li>\n<li>We fully invest in our team, we will help you build yourself up in any area you feel you need development, be it in English, learning a new programming language, product understanding and more. We want to make sure that you&rsquo;re always learning and developing yourself whilst a part of our team.</li>\n<li>We respect both Product and Technology equally, ensuring all of the Products we work on have features with true market potential and ensuring all of the team contribute to, understand and believe in what they are developing</li>\n<li>We are very selective with our Clients, we only work on awesome Products we believe in and that show strong market potential</li>\n<li>We respect you and your personal hours, we keep sustainable pace by working standard 8 hour days from Monday to Friday, ensuring we only plan for what we can achieve</li>\n<li>We work fully agile, and only work with Clients who work the same, working with set sprint goals and working at our rate of velocity</li>\n</ul>\n<h2>Contact</h2>\n<p>Khac Anh: ka_at_codelink_dot_io (0907_232_143)</p>\n          </td>\n        </tr>\n      </tbody>\n    "], "546": ["INNAWAY - Front-end  Developer - Ha Noi - FT", "May 22, 2017", "https://github.com/awesome-jobs/vietnam/issues/546", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>No. 15, Lane 76, To Ngoc Van Hanoi, Vietnam</li>\n<li>Remote</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>$700 - $900/month or range</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Averagely good at English (verbal and written)</li>\n<li>2+ years experience in working with front-end projects</li>\n<li>Proficient at JavaScript library and framework (jQuery, Angular / React)</li>\n<li>Excellent at HTML, HTML 5, CSS</li>\n<li>Knowledge of CSS preprocessors (i.e. Sass)</li>\n<li>Excellent with CSS frameworks like Bootstrap</li>\n<li>Working experience with GIT</li>\n<li>Experience with Agile methodology (Scrum)</li>\n<li>Knowledge of SEO principles</li>\n<li>Open-minded and good at adapting to frequent changes, willing to learn new technologies while working</li>\n</ul>\n<h2>Skills</h2>\n<ul>\n<li>Strong knowledge in HTML5/CSS3 markup skills</li>\n<li>Proficient understanding of client-side scripting and JavaScript frameworks, including jQuery</li>\n<li>Knowledge of advanced JavaScript libraries and frameworks, such as AngularJS</li>\n<li>Good understanding of asynchronous request handling, partial page updates, and AJAX</li>\n<li>Proficient understanding of code versioning tools, such as Git</li>\n<li>Familiar with browser testing and debugging</li>\n<li>Proficient understanding of cross-browser compatibility issues and ways to work around them.</li>\n<li>Good knowledge of the entire web development process (design, development and deployment)</li>\n<li>Knowledge of SEO principles and ensuring that application will adhere to them.</li>\n<li>Knowledge of layout aesthetics</li>\n<li>Excellent analytical and multitasking skills</li>\n</ul>\n<h3>Must Have</h3>\n<ul>\n<li>Be able to communicate in English (written and verbal) at least intermediate level.</li>\n<li>Be able to discuss technical problems with peers</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>At least 2+ years of experience working with web or mobile web projects</li>\n<li>BSc degree in Computer Science or relevant field / Higher Diploma in software engineering</li>\n</ul>\n<h3>You&rsquo;ll be responsible for</h3>\n<ul>\n<li>Executing and converting designs into HTML5/CSS</li>\n<li>Implementing standards-compliance and cross-browser front-end code of the enterprise mobile and web applications with HTML, CSS, Javascript using library/framework including jQuery, Bootstrap, etc</li>\n<li>Optimize application for maximum speed and scalability</li>\n<li>Assure that all user input is validated before submitting to back-end</li>\n<li>Create quality mock-ups and prototypes</li>\n<li>Collaborate with back-end developers, web designers, and other team members to improve usability</li>\n<li>Help back-end developers with coding and troubleshooting</li>\n<li>Collaborating with other teams to design and implement responsive web features</li>\n</ul>\n<h3>You can bring</h3>\n<ul>\n<li>Interpersonal skills</li>\n<li>Analytical skills</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<p>We&rsquo;re passionate about opening access to a historically exclusive marketplace to an ever broader customers, we&rsquo;re relentlessly building a system, so intuitive that customers with quality driven will easily get their appetite satisfied on our platform. Join our growing team, with intelligent individuals from hospitality, business, and technology.<br/>\nBelow are some captivating benefits provided</p>\n<ul>\n<li>You can work remotely (if not in Ha Noi city)</li>\n<li>Company trip 1 time/year within the country</li>\n<li>Review salary 1 time/year</li>\n<li>Monthly team lunch or dinner</li>\n<li>Extra activities (games, movies, picnic, etc)</li>\n<li>Holidays are in accordance with Vietnamese law.</li>\n</ul>\n<h3>What are hard problems that your company is trying to solve?</h3>\n<p>Building the fastest, a well structured, and a huge and scalable system for mid-range travelers. Focusing on boutique and design hotels</p>\n<h3>Contact</h3>\n<p>Homepage: innaway.co<br/>\nHR Department: <a href=\"mailto:hr@innaway.co\">hr@innaway.co</a></p>\n          </td>\n        </tr>\n      </tbody>\n    "], "596": ["URBN8 - Senior PHP DEVELOPER - Ho Chi Minh City - Full time", "Jun 29, 2017", "https://github.com/awesome-jobs/vietnam/issues/596", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Ho Chi Minh City, Vietnam</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>$800 - $1000</li>\n</ul>\n<h2>Requirements</h2>\n<h3>Technical Skills Required</h3>\n<ul>\n<li>Bachelor's degree in Computer Science or related field or equivalent work experience.</li>\n<li>Must have experience in working with database backend (PostgreSQL, MySQL or MongoDB).</li>\n<li>Good practice experiences with CSS, HTML(5), Javascript, JSON.</li>\n<li>Having good knowledge of Design Pattern, Restful, OOP.</li>\n<li>Good experiences with Magento/ Lavarel framework, October CMS.</li>\n<li>Have 1 or 2 year experiences on programming.</li>\n<li>Experienced in Agile software development methods (such as Scrum or Kanban) or eager to learn them.</li>\n</ul>\n<h3>Personal Skills Required</h3>\n<ul>\n<li>Good spoken and written command of English.</li>\n<li>Excellent problem solving skills with strong attention to detail.</li>\n<li>Strong communication skills.</li>\n<li>Demonstrated ability to set and meet tight deadlines and function well under pressure.</li>\n<li>Ability to help others; work in a team where a culture of learning and sharing knowledge is encouraged.</li>\n<li>Great sense of humour and a passion for life is a must!</li>\n</ul>\n<h2>Skills</h2>\n<h3>Must Have</h3>\n<ul>\n<li>Magento/ Lavarel framework.</li>\n<li>CSS, HTML(5), Javascript, JSON.</li>\n<li>Experience working with database (PostgreSQL, MySQL or MongoDB...).</li>\n<li>Design Pattern, Restful, OOP knowledge.</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>October CMS, WordPress.</li>\n<li>Agile software development methods (such as Scrum or Kanban).</li>\n</ul>\n<h3>Responsibilities</h3>\n<p>Great power comes with great responsibilities!</p>\n<h3>You&rsquo;ll be responsible for</h3>\n<ul>\n<li>\n<p>As a PHP/HTML Designer / Developer, you will work on full stack, and should have solid exposure / experience with any of the following: Magento, WordPress, Lavarel Framework, October CMS, in addition, you need to be able to work on both backend API and front end HTML, CSS and basic design work (layout etc.).</p>\n</li>\n<li>\n<p>You will be responsible for building, testing, debugging and troubleshooting web services, programs, and scripts for various functions, and modifying existing code to add new features.</p>\n</li>\n<li>\n<p>Participate in analyzing requirements, design architecture, implementation, test and deployment process.</p>\n</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>Training opportunities: We will provide professional training and official certification for Magento, on a range of subjects either technical or non-technical such as English pronunciation, Agile / Scrum coaching.</li>\n<li>Colleagues: In order to make you feel like \"home\", we will ensure coffee, snacks, regular BBQ&rsquo;s, parties and team building events on a bi-monthly basis to keep you and the team fully engaged.</li>\n<li>Holidays: In addition to the standard government compulsory holidays, we will provide you with 20 working days paid holiday and 10 working days paid sick leave. Total of 32 holiday plus sick leave.</li>\n</ul>\n<h3>Interesting Engineering Projects</h3>\n<ul>\n<li>Opportunity to work with brand new Magento 2 projects.</li>\n<li>Build and nurture Magento Plugin/Service utilizing Microservices Architecture on the Magento marketplace.</li>\n<li>Work on Frontend with the latest technologies e.g. ES2015/2016, CSS3.</li>\n</ul>\n<h3>Contact</h3>\n<ul>\n<li><a href=\"https://www.facebook.com/urbn8/\">urbn8</a></li>\n<li>For further detail about our company and this position, feel free to reach me at: <a href=\"mailto:anh.nguyen@tripolis.com\">anh.nguyen@tripolis.com</a></li>\n</ul>\n          </td>\n        </tr>\n      </tbody>\n    "], "565": ["Wefit -Software Engineer - Hanoi - FT", "May 31, 2017", "https://github.com/awesome-jobs/vietnam/issues/565", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>HaNoi, Vietnam</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>Negotiate</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Have passion in developing products for end user, willing to learn new technology</li>\n<li>Have knowledge about HTML5/CSS3/Javascript, SASS/SCSS</li>\n<li>Have knowledge about Jquery and one of frameworks: ReactJS, AngularJS, VueJS</li>\n<li>Familiar with Git</li>\n<li>Have basic Photoshop skill: crop, resize, measure,&hellip;</li>\n</ul>\n<h2>Skills</h2>\n<ul>\n<li>Javascript, html, css, sass/scss</li>\n<li>Photoshop</li>\n</ul>\n<h3>Must Have</h3>\n<ul>\n<li>\n<p>Have passion in developing products for end user, willing to learn new technology</p>\n</li>\n<li>\n<p>Javascript(ES5, ES6), html, css</p>\n</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>ReactJS, AngularJS, VueJS</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Build and develop components of WeFit webapp</li>\n<li>Teamwork with engineering team and UI/UX team</li>\n<li>Attend meetings and contribute ideas for the product</li>\n</ul>\n<h3>Why it would be awesome to work with us (REQUIRED)</h3>\n<ul>\n<li>Being train both in programming and product developing with young dynamic team</li>\n<li>Transparent evaluation process, fast growing salary (15%/year in average)</li>\n<li>Have chance to join ESOP (employee stock ownership plan) every 6 months</li>\n</ul>\n<h3>Interesting Engineering Projects</h3>\n<ul>\n<li>Build flexible components for wefit webapp</li>\n</ul>\n<h3>Contact</h3>\n<p>Homepage: wefit.vn<br/>\nWefit: <a href=\"mailto:anhhth@wefit.vn\">anhhth@wefit.vn</a> (+84 047 304 1155)</p>\n          </td>\n        </tr>\n      </tbody>\n    "], "547": ["Oddle - Backend Engineer (Java) - HCM - FT", "May 22, 2017", "https://github.com/awesome-jobs/vietnam/issues/547", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Ho Chi Minh, Vietnam (Full-time)</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>$1000 - $1,500 depending on experience</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>3-5 years experience in Java with Spring Framework and Hibernate ORM</li>\n<li>Experience with Relational Databases and SQL</li>\n<li>Experience with API and Framework Design and third-party API integration</li>\n<li>Strong communication skills with a positive attitude</li>\n<li>Degree in Computer Science, Software Engineering or a related subject is preferred</li>\n</ul>\n<h3>Must Have</h3>\n<ul>\n<li>Proficient in Java</li>\n<li>3-5 years experience with Spring and Hibernate</li>\n<li>Good to excellent command of English</li>\n<li>Strong team player and collaboration</li>\n<li>Good self-awareness and a desire to continually improve</li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Design and build scalable REST APIs for Oddle platform and other microservices</li>\n<li>Collaborate with frontend team to decide how an API method should work</li>\n<li>Work with Product team to build innovative, robust, and easy-to-use features for our users</li>\n<li>Improve and optimise performance of infrastructure and database</li>\n<li>Write clean, human-readable code with unit tests</li>\n<li>Triage bugs and troubleshoot production issues</li>\n<li>Improve code quality and increase unit and end-to-end test coverage</li>\n<li>Mentor junior engineers when necessary (for Lead role)</li>\n</ul>\n<h2>About Oddle</h2>\n<p>Oddle is a Singapore-based startup that provides a smart online ordering system that enables F&amp;B business owners to manage their own take-away orders and grow their business. Since our platform launched in 2014, Oddle is heating up the food delivery space, with over USD16 million worth of orders transacted!</p>\n<p>Unlike marketplaces, Oddle is a cloud-based, e-commerce and orders management solution which caters specifically to the operations of F&amp;B businesses. Our solution is a unified, all-in-one online ordering system \u2028which funnels all orders to designated restaurants.</p>\n<h2>What hard problems we're trying to solve here</h2>\n<p>Our story goes back to 2013 &mdash; we were our products' first users! As restaurateurs ourselves, we understand how hard it was to manage delivery and takeaway orders. \u2028With orders streaming in during peak hours via multiple channels, \u2028it&rsquo;s hard for restaurateurs to keep up.</p>\n<p>Furthermore, marketplace solutions didn't provide for the autonomy and individual marketing needs of each restaurant. New names get lost in the sea of similar food places. It isn&rsquo;t exactly a win-win situation for the bigger players either. All orders are priced on a commission-based scheme, including returning customers!</p>\n<p>Coupled with pressing challenges in the industry, we realised F&amp;B players need technology more than ever to grow their business beyond the 4 walls of a restaurant. Drawing insights from several restaurant owners, we saw a true need for a affordable and more ops-friendly solution.</p>\n<h2>Why it would be awesome to work with us</h2>\n<ul>\n<li>Working with a passionate and driven team</li>\n<li>Cool bosses</li>\n<li>Performance bonus 2 times/year</li>\n<li>Laptop and monitor will be provided</li>\n<li>15 leave days/year</li>\n</ul>\n<p>Looking to immerse yourself right at the heart of the start-up ecosystem? You are looking at the &ldquo;next big thing&rdquo;. Since our inception in 2014 as a B2B company, Oddle has been a leading force in offering the best-in-class enterprise software that transforms how restaurants participate in the online revolution and how people order food online.</p>\n<p>With Oddle, you can be part of creating the most exciting user experiences for people all over the world. We strive to be world-changing and continue blazing the trail - creating the most exhilarating food ordering consumer experiences and improving business decisions through data.</p>\n<h2>Contact</h2>\n<p>Homepage: <a href=\"https://oddle.me\">https://oddle.me</a><br/>\nChelsea (Talent Acquisition) at <a href=\"mailto:chelsea@oddle.me\">chelsea@oddle.me</a> or <a href=\"mailto:joinus@oddle.me\">joinus@oddle.me</a></p>\n<p><a href=\"https://camo.githubusercontent.com/b722f7a4bfbca37bce7557b43e77040f46d0debf/68747470733a2f2f63646e2e74656368696e617369612e636f6d2f646174612f696d616765732f39356538326235333730313838353330383938383862303735313365626332332e6a7067\" target=\"_blank\"><img data-canonical-src=\"https://cdn.techinasia.com/data/images/95e82b537018853089888b07513ebc23.jpg\" src=\"https://camo.githubusercontent.com/b722f7a4bfbca37bce7557b43e77040f46d0debf/68747470733a2f2f63646e2e74656368696e617369612e636f6d2f646174612f696d616765732f39356538326235333730313838353330383938383862303735313365626332332e6a7067\" style=\"max-width:100%;\"/></a></p>\n<p><a href=\"https://camo.githubusercontent.com/f7f38da2c760292479638136bdb94b4723886df6/68747470733a2f2f63646e2e74656368696e617369612e636f6d2f646174612f696d616765732f35653430396132616336306164363261643539393334343532633465336333312e6a7067\" target=\"_blank\"><img data-canonical-src=\"https://cdn.techinasia.com/data/images/5e409a2ac60ad62ad59934452c4e3c31.jpg\" src=\"https://camo.githubusercontent.com/f7f38da2c760292479638136bdb94b4723886df6/68747470733a2f2f63646e2e74656368696e617369612e636f6d2f646174612f696d616765732f35653430396132616336306164363261643539393334343532633465336333312e6a7067\" style=\"max-width:100%;\"/></a></p>\n<p><a href=\"https://camo.githubusercontent.com/e8fdac7783265a109de33a4c7b69a121efb68d5d/68747470733a2f2f63646e2e74656368696e617369612e636f6d2f646174612f696d616765732f37353332366366663830363661623338333737643336306630373761306638622e6a7067\" target=\"_blank\"><img data-canonical-src=\"https://cdn.techinasia.com/data/images/75326cff8066ab38377d360f077a0f8b.jpg\" src=\"https://camo.githubusercontent.com/e8fdac7783265a109de33a4c7b69a121efb68d5d/68747470733a2f2f63646e2e74656368696e617369612e636f6d2f646174612f696d616765732f37353332366366663830363661623338333737643336306630373761306638622e6a7067\" style=\"max-width:100%;\"/></a></p>\n          </td>\n        </tr>\n      </tbody>\n    "], "544": ["1PAC Vietnam - Frontend developer - HCM - FT", "May 22, 2017", "https://github.com/awesome-jobs/vietnam/issues/544", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <p><a href=\"https://cloud.githubusercontent.com/assets/16432674/26290061/f3ba3a12-3ece-11e7-8d02-883786d0285e.png\" target=\"_blank\"><img alt=\"logotype_black\" src=\"https://cloud.githubusercontent.com/assets/16432674/26290061/f3ba3a12-3ece-11e7-8d02-883786d0285e.png\" style=\"max-width:100%;\"/></a></p>\n<p>1PAC Vietnam is a new creative production company with its headquarter in Tokyo. We do planning, consulting, build and develop web system and application. We provide these services as one stop solution by cooperating with our headquarter in Japan. We will help clients optimize their ways to communicate with end-users utilizing our ideas and creatives, solve a variety of problems and take new approaches.</p>\n<h2>Location</h2>\n<ul>\n<li>District 1, Ho Chi Minh City, Vietnam</li>\n<li>Our homepage: <a href=\"http://1pac.vn\">http://1pac.vn</a></li>\n<li>Our facebook: <a href=\"https://www.facebook.com/1pacvietnam/\">https://www.facebook.com/1pacvietnam/</a></li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>$500-$1200</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>2++ years working with HTML5/CSS3 and Javascript</li>\n<li>Very strong skill with vanilla Javascript and Jquery is a must</li>\n<li>Have knowledge of OOP Javascript programming</li>\n<li>Experience in CSS preprocessor SASS</li>\n<li>Writing well organized, clean and scalable CSS/SASS</li>\n<li>Experience in solving cross browser compatibility</li>\n<li>Experience in working with API</li>\n<li>Have knowledge of Task runner tool Grunt/Gulp (we prefer Grunt)</li>\n<li>Have knowledge of Git and Github is a plus (we mainly work with Github)</li>\n</ul>\n<h3>Nice to have</h3>\n<ul>\n<li>Github account with public projects</li>\n<li>Experienced with ES6/VueJS/Webpack/Mocha</li>\n<li>Ability to design web layout</li>\n<li>Having knowledge of server side languages (PHP, Ruby)</li>\n<li>Having knowledge of web security</li>\n</ul>\n<h3>Your job</h3>\n<ul>\n<li>Building UI and web layout</li>\n<li>Designing and developing single web application (SPA)</li>\n<li>Researching new technology, sharing your knowledge and apply it to real product</li>\n<li>Delivering high quality product that run cross browser</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>Personal Macbook Pro provided</li>\n<li>You can work and learn directly from senior Japanese engineer in head office</li>\n<li>We use the one of the coolest application: Github, slack</li>\n<li>Review salary 2 times/year</li>\n<li>Business trip in Japan</li>\n<li>Company trip 1-2 times/year</li>\n<li>Dinner and lunch party every month</li>\n<li>Extra activities (watch movie, picnic&hellip;)</li>\n<li>Others benefits such as holidays and insurance benefits follow Vietnamese law.</li>\n</ul>\n<h3>Interesting Engineering Projects</h3>\n<ul>\n<li>Attendance management web/ application using Ruby and ReactNative</li>\n<li>A Slack BOT to give appreciation and say thank you for other team member</li>\n</ul>\n<h3>Contact</h3>\n<ul>\n<li>Person in charge: Ms.Thao</li>\n<li>Email: <a href=\"mailto:redstar.thao@1pac.vn\">redstar.thao@1pac.vn</a></li>\n<li>Phone: 090-2816-440</li>\n</ul>\n          </td>\n        </tr>\n      </tbody>\n    "], "572": ["Oddle - Lead Java Engineer - Saigon - FT", "Jun 5, 2017", "https://github.com/awesome-jobs/vietnam/issues/572", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Saigon, Vietnam</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>Negotiable</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>5+ years experience in relevant position</li>\n<li>Experience with Relational Databases and SQL</li>\n<li>Experience with API and Framework Design and third-party API integration</li>\n<li>Experience with team management</li>\n<li>Experience as a full-stack engineer</li>\n<li>Strong English command and communication skills</li>\n<li>Degree in Computer Science, Software Engineering or a related subject is preferred</li>\n</ul>\n<h2>Skills</h2>\n<h3>Must Have</h3>\n<ul>\n<li>5 years or more experience in Java with Spring Framework and Hibernate ORM</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design and build scalable REST APIs for Oddle platform and other microservices</li>\n<li>Collaborate with frontend team to decide how an API method should work</li>\n<li>Work with Product team to build innovative, robust, and easy-to-use features for our users</li>\n<li>Improve and optimise performance of infrastructure and database</li>\n<li>Write clean, human-readable code with unit tests</li>\n<li>Triage bugs and troubleshoot production issues</li>\n<li>Improve code quality and increase unit and end-to-end test coverage</li>\n<li>Mentor junior engineers when necessary</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>Opportunity to work on our product development and major projects</li>\n<li>Working with a brilliant and supportive technical and product teams, where you can learn and challenge each other to make a meaningful impact</li>\n<li>Hack your growth by forcing yourself out of comfort zone and learning new skills and technologies</li>\n<li>Competitive salary and benefits, with 2 performance bonus a year</li>\n<li>Monthly happy hour, annual company trip</li>\n<li>Join us to find out more for yourself!</li>\n</ul>\n<h3>What are hard problems that your company is trying to solve?</h3>\n<p>Oddle is a Singapore-based startup that provides a smart online ordering system which enables F&amp;B business owners to manage their own take-away orders and grow their business. Since our platform launched in 2014, Oddle is heating up the food delivery space, with over USD16 million worth of orders transacted!</p>\n<p>Unlike marketplaces, Oddle is a cloud-based, e-commerce and orders management solution which caters specifically to the operations of F&amp;B businesses. Our solution is a unified, all-in-one online ordering system \u2028which funnels all orders to designated restaurants.</p>\n<h3>Contact</h3>\n<p>Homepage: <a href=\"https://oddle.me/\">https://oddle.me/</a></p>\n<p>If you are someone who appreciates writing elegant APIs, solving complex problems, or building scalable infrastructure, we want to speak to you! Drop in your resume now to <a href=\"mailto:chelsea@oddle.me\">chelsea@oddle.me</a>!</p>\n          </td>\n        </tr>\n      </tbody>\n    "], "601": ["LARION - Ruby on Rails Developer - Saigon - FT", "Jul 3, 2017", "https://github.com/awesome-jobs/vietnam/issues/601", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Hall 5, Quang Trung Software City, Tan Chanh Hiep Ward, District 12, HCMC</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>Up to $2000</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>English: Intermediate level or above</li>\n<li>Solid understanding of object-oriented programming</li>\n<li>Hands-on experiences with API, cURL, PostgreSQL / Mysql</li>\n<li>Proficient in Bootstrap, JQuery, CSS3, HTML5</li>\n<li>Familiarity with modern front end frameworks: Angular, Ember, React, Backbone</li>\n</ul>\n<h2>Skills</h2>\n<ul>\n<li>Ruby on Rails</li>\n</ul>\n<h3>Must Have</h3>\n<ul>\n<li>Experienced with file system, cloud storage, network resources</li>\n<li>Experienced with normalized relational model and non-relational data stores</li>\n<li>Experienced with Spree or an eCommerce platform</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>Experience with Ruby on Rails (at least 1 year)</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, build, and maintain efficient, reusable, and reliable Ruby code</li>\n<li>Analyze client requirements to develop functional and technical software requirements</li>\n<li>Setup environment and release web applications</li>\n<li>Contribute in all phases of the development life-cycle</li>\n<li>Drive continuous adoption and integration of relevant new technologies into design</li>\n<li>Conduct code refactoring, optimization</li>\n<li>Perform other technical tasks assigned by the PM</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>Attractive salary and benefits (13th salary, distinguised employee of the quater and year, seniority award...)</li>\n<li>Performance appraisal twice a year</li>\n<li>Healthcare and accident insurance</li>\n<li>Various training on best practices and soft skills</li>\n<li>Teambuilding activities in every summer, company trip, big annual year-end party every year, etc.<br/>\nFitness &amp; sports activities: football, tennis, table-tennis, badminton...</li>\n<li>Commitment to community development: charity every quarter, blood donation, public seminars, career orientation talks&hellip;</li>\n<li>Free in-house entertainment facilities (foodball, table tennis, boxing, coffee...)</li>\n<li>Support for personal loans such as: home loan, vehicle loan, tuition fee...</li>\n</ul>\n<h3>Interesting Engineering Projects</h3>\n<ul>\n<li>We provide full-stack services of Ruby on Rails Application Development. Generally, our Ruby on Rails Application Development Services consist of Web App Development and Web App Maintenance.</li>\n<li>Saving working time by 25%, LARION helped Customer save cash, headcount and customer satisfaction with the SurroundCore Solution</li>\n</ul>\n<h3>Contact</h3>\n<p>Email: <a href=\"mailto:recruitment@elarion.com\">recruitment@elarion.com</a></p>\n          </td>\n        </tr>\n      </tbody>\n    "], "583": ["FiteGlobal - Senior/Lead Full stack Developer - Saigon - FT", "Jun 9, 2017", "https://github.com/awesome-jobs/vietnam/issues/583", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Saigon, Vietnam</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>From $1400 to $1500 per month</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Python, Ruby, SQL, noSQL,</li>\n<li>Experience with micro-service architecture</li>\n<li>3+ years Full stack Developer experience</li>\n<li>Solid understanding of Data Modeling</li>\n<li>Understanding of agile software development</li>\n<li>Experience with team management</li>\n</ul>\n<h2>Skills</h2>\n<h3>Must Have</h3>\n<ul>\n<li>Understanding of Automated testing</li>\n<li>Experience working with RESTful API type web services</li>\n<li>Experience in developing applications leveraging XML/JSON</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>Well-versed and active user of GitHub</li>\n<li>Prefer experience working in an agile development environment.</li>\n<li>Prefer experience developing applications on the Cloud, such as EC2 using relevant tools.</li>\n<li>Prefer knowledge of cryptocurrency, blockchain, smart contract.</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Maintain code quality, organization and automation</li>\n<li>Design, build, and maintain efficient, reusable, and reliable Javascript code</li>\n<li>Full stack Web development</li>\n<li>Provide development task effort estimates</li>\n<li>Triage bugs and troubleshoot production issues</li>\n<li>Collaborate with frontend team to decide how an API method should work</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>Money money money</li>\n<li>Pioneering new digital industry.</li>\n<li>Brotherhood working environment.</li>\n</ul>\n<h3>Interesting Engineering Projects</h3>\n<ul>\n<li>Get brand new issues.</li>\n<li>Massive data though the server, deal with it.</li>\n</ul>\n<h3>Contact</h3>\n<p>Homepage: <a href=\"https://itviec.com/it-jobs/sr-front-end-engineer-javascript-fiteglobal-2624\">https://itviec.com/it-jobs/sr-front-end-engineer-javascript-fiteglobal-2624</a><br/>\nTrollman: truongvan at fiteglobal dot com</p>\n          </td>\n        </tr>\n      </tbody>\n    "], "602": ["[fram^ Vietnam] - [Senior/ Principal PHP Engineer] - [Da Nang] - [FT]", "Jul 4, 2017", "https://github.com/awesome-jobs/vietnam/issues/602", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <p><a href=\"https://user-images.githubusercontent.com/29363533/27818283-338d348e-60bf-11e7-8540-aee3c287ad95.png\" target=\"_blank\"><img alt=\"logo\" src=\"https://user-images.githubusercontent.com/29363533/27818283-338d348e-60bf-11e7-8540-aee3c287ad95.png\" style=\"max-width:100%;\"/></a></p>\n<h2>Location</h2>\n<ul>\n<li>Da Nang, Vietnam</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>$1200 - $2000 gross/month</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>PHP</li>\n<li>Laravel Framework</li>\n<li>Fluent English skills</li>\n<li>3+ years Software Engineering experience</li>\n</ul>\n<h2>Skills</h2>\n<h3>Must Have</h3>\n<ul>\n<li>Smart and experienced in Backend development (more than 3 years).</li>\n<li>Experienced in PHP and Laravel (version &gt; 5.0) for 1 year, at least</li>\n<li>Good understanding about OOP concepts</li>\n<li>Good understanding about relational database (Oracle, Postgres, MySQL)</li>\n<li>Experienced with cache frameworks (Redis, Memcached)</li>\n<li>Experienced with Version control systems (Git/ Mercurial)</li>\n<li>Experience with UnitTest in PHP</li>\n<li>Not afraid of Frontend tasks, HTML/CSS/Javascript</li>\n<li>Good at English communication skills, responds to questions directly, promptly, without diverging from the subject too much</li>\n<li>Able to write well-structured, maintainable code</li>\n<li>Worked with Agile (SCRUM/ Kanban)</li>\n</ul>\n<h3>Nice to have</h3>\n<ul>\n<li>Good understanding about Microservices, Service Oriented Design, DDD (Domain Driven Design)</li>\n<li>Good awareness about TDD, BDD</li>\n<li>Worked with statically typed programming languages (Java/C/C++/C#)</li>\n<li>Interested in devops</li>\n<li>Experienced in Docker/Vagrant</li>\n<li>Eager to learn new technologies and stay up-to-dated with modern frameworks</li>\n<li>You have a can-do-attitude and put the goals of the team before your own prestige</li>\n<li>You are able and hungry to take on a lot of responsibility</li>\n</ul>\n<h3>Responsibilities</h3>\n<p>You will improve the product and develop new features of a web-based SaaS technology startup in the HR and recruiting space . Most important is that your coding should be at the highest standard, easily maintainable and easy to read. You are able to work independently, you deliver on time and you take initiative to keep team communication alive at all times.</p>\n<h3>More on fram^ &ndash; what is it like to work in Fram?</h3>\n<p>We are passionate individuals that are driven to succeed. Our work culture is characterized by strong team spirit, high degrees of openness and innovation, and strong collaboration across fields. We love the freedom of an entrepreneurial company and are looking for like-minded, ambitious professionals who have a desire to build something new and actively support our young company in its growth to greatness.</p>\n<h3>You will love working here!</h3>\n<ul>\n<li>Excellent and competitive salary package with 13th monthly salary and a good long‐term and performance bonus</li>\n<li>5-day working week (Monday-Friday), working hours to some extent flexible</li>\n<li>Professional and open working environment, with the culture and office of a Scandinavian online company, in Indochina Riverside Tower, Da Nang city.</li>\n<li>More annual leaves than Vietnam&rsquo;s Labor Law (Swedish national day and Christmas Eve) and will increase by working years. Vietnamese standard health insurance plus Premium health care package.</li>\n<li>Opportunities to improve English skills within an international team &ndash; English is an official language in fram^ office. Also regular English lessons two times per week by native English teachers in the office</li>\n<li>Opportunities to gain hands-on experience in cutting-edge technologies</li>\n<li>Opportunities to become one of the key members of fram^ as we build this fast growing company together!</li>\n<li>Guaranteed permanent employment and career development.</li>\n</ul>\n<p><a href=\"https://user-images.githubusercontent.com/29363533/27818168-c654e628-60be-11e7-941d-8529422344f5.jpg\" target=\"_blank\"><img alt=\"fram 1\" src=\"https://user-images.githubusercontent.com/29363533/27818168-c654e628-60be-11e7-941d-8529422344f5.jpg\" style=\"max-width:100%;\"/></a></p>\n<p><a href=\"https://user-images.githubusercontent.com/29363533/27818172-cea46db2-60be-11e7-8331-a261edf5cb0c.jpg\" target=\"_blank\"><img alt=\"fram 2\" src=\"https://user-images.githubusercontent.com/29363533/27818172-cea46db2-60be-11e7-8331-a261edf5cb0c.jpg\" style=\"max-width:100%;\"/></a></p>\n<h3>Contact</h3>\n<p>Homepage: <a href=\"https://wearefram.com/\">https://wearefram.com/</a><br/>\nContact person: Ms. Hao<br/>\nContact address: <a href=\"mailto:careers@wearefram.com\">careers@wearefram.com</a> (Telephone number: 02838217790)</p>\n          </td>\n        </tr>\n      </tbody>\n    "], "557": ["Dinosys - UI-UX Designer - HCM - FT", "May 24, 2017", "https://github.com/awesome-jobs/vietnam/issues/557", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<p>Founded by a group of seasoned IT professionals, Dinosys is an innovator in the business of designing, integrating and managing world-class technology products and solutions. Our founders realized the power of digitalization in providing solutions to businesses with pressing challenges and exciting opportunities in today&rsquo;s increasingly interconnected world. Specialized in system integration, software development and outsourcing, Dinosys is striving to become a leading ICT company in Vietnam and Southeast Asia. Combining unrivalled experience across many industries and business functions, and extensive relationship with the world&rsquo;s biggest technology companies, Dinosys partners with clients to help develop capabilities, drive performance improvements and achieve enduring successes.</p>\n<ul>\n<li>204 Pasteur, Ward 6, Distrist 3</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>$600 - $1000/month</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>1-3 years of digital design experience.</li>\n<li>English proficiency.</li>\n<li>Familiar with design and prototyping tools such as: Sketch; Zeplin; InVision.</li>\n<li>Familiar with graphic design tools, specially Adobe Suite.</li>\n<li>Experience designing for a range of platforms and devices, such as: iOS; Android; Responsive; Tablet; and Mobile.</li>\n<li>Strong communication, facilitation and presentation skills.</li>\n<li>Excellent attention to detail.</li>\n<li>Analytical and strong problem solving skills.</li>\n<li>Ability to produce results independently as well as collaboratively in a team environment.</li>\n<li>Experience designing for a range of industries and product types will be highly regarded.</li>\n<li>Curiosity, enthusiasm and willingness to learn.</li>\n</ul>\n<h2>Skills</h2>\n<ul>\n<li>Digital design experience</li>\n<li>Tools: Sketch; Zeplin; InVision</li>\n</ul>\n<h3>Must Have</h3>\n<ul>\n<li>1-3 years of digital design experience.</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>Experience designing for a range of platforms and devices, such as: iOS; Android; Responsive; Tablet; and Mobile.</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design the approach and conduct User research.</li>\n<li>Create and communicate User flows, Information Architecture, Wireframes and Sitemaps to a wide variety of people with varying levels of interface ability and knowledge including: Client representatives, Consumers, Development Teams, Designers, Producers, Senior Managers, Commercial team, and Suppliers</li>\n<li>Capture, analyze and communicate findings throughout the project.</li>\n<li>Present ideas, concepts and pitches in a relevant, timely and engaging manner (from casual sketches fully realized visuals)</li>\n<li>Deliver pixel-perfect designs that are as usable as they are beautiful.</li>\n<li>Assist with pitches, presentations and other graphic design needs.</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>Come and work with us. You will have opportunity to learn new technologies with international standard, build products that are different/innovative and get various benefits:</li>\n<li>Working in dynamic invironment, young, professional and fast growing</li>\n<li>Laptop is provided</li>\n<li>12 days annual leaves, working Monday - Friday, flexible working time</li>\n<li>Salary review 2 times/ year</li>\n<li>Free parking for your bike</li>\n<li>Employee Benefits: Social insurance, Health insurance.</li>\n<li>Unemployment insurance and Sick leave: based on current relevant Laws</li>\n<li>Team building monthly</li>\n<li>Training new technology frequently</li>\n</ul>\n<h3>What are hard problems that your company is trying to solve?</h3>\n<ul>\n<li>You will have opportunity to learn new technologies with international standard, build products that are different/innovative</li>\n</ul>\n<h3>Contact</h3>\n<p>Email: <a href=\"mailto:oanh.tang@dinosys.vn\">oanh.tang@dinosys.vn</a><br/>\nPhone: 0909 617 173<br/>\nSkype: tangoanh<br/>\nFB: <a href=\"https://www.facebook.com/oanhtang195\">https://www.facebook.com/oanhtang195</a><br/>\nWebsite: <a href=\"https://dinosys.vn/joinus/\">https://dinosys.vn/joinus/</a></p>\n          </td>\n        </tr>\n      </tbody>\n    "], "575": ["LARION - Senior BA cum Scrum Master - Saigon - FT", "Jun 6, 2017", "https://github.com/awesome-jobs/vietnam/issues/575", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Hall 5, Quang Trung Software City, Tan Chanh Hiep Ward, District 12, HCMC</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>$1200 ~ $1500</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>At least 4 years of business analysis related experience in software development projects</li>\n<li>At least 2 years of working experience in Scrum Master or Project Manager</li>\n<li>Strong communications, mentoring, and negotiation skills with stakeholders</li>\n<li>Use of English proficiency (Read and understand specialized documents)</li>\n<li>Excellent knowledge at software engineering and SDLC</li>\n<li>Strong at the tools, techniques, processes required to capture requirements at generic and detailed levels. Those are for example: UML, OpenOffice, Mindmap, Trello, Basecamp, Pivotal Tracker, Mavenlink, Jira, Mantis, Redmine</li>\n</ul>\n<h2>Skills</h2>\n<ul>\n<li>Business Analyst</li>\n<li>Scrum Master</li>\n</ul>\n<h3>Must Have</h3>\n<ul>\n<li>Have a deep know-how (at expert level) on at least 1 business domain (e.g. Healthcare, Finance, Security, Insurance...) for at least 3 continuous years in projects</li>\n<li>Ability to write documents URD, SRS</li>\n<li>Able to perform check (test) the business requirements</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Gather business and system requirements from client</li>\n<li>Assist client to define requirements, suggest ideas, and provide solutions</li>\n<li>Communicate with customers to clarify any unclear information about the business requirements</li>\n<li>Analyze and specify requirements, synthesize information provided by relevant stakeholders</li>\n<li>Design application mock-up / wire-frame using prototyping tools and model the requirements by using charting tools</li>\n<li>Work with Quality Controller (QC) to verify that all system requirements, including change requests, are implemented and traceable</li>\n<li>Take main BA role in big/complex projects (team size &gt; 15)</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>Attractive salary and benefits (13th salary, distinguised employee of the quater and year, seniority award...)</li>\n<li>Performance appraisal twice a year</li>\n<li>Healthcare and accident insurance</li>\n<li>Various training on best practices and soft skills</li>\n<li>Teambuilding activities in every summer, company trip, big annual year-end party every year, etc.<br/>\nFitness &amp; sports activities: football, tennis, table-tennis, badminton...</li>\n<li>Commitment to community development: charity every quarter, blood donation, public seminars, career orientation talks&hellip;</li>\n<li>Free in-house entertainment facilities (foodball, table tennis, boxing, coffee...)</li>\n<li>Support for personal loans such as: home loan, vehicle loan, tuition fee...</li>\n</ul>\n<h3>Interesting Engineering Projects</h3>\n<p>Our wide range of services includes:</p>\n<ul>\n<li>Ruby on Rails Web Application Development</li>\n<li>Big Data &ndash; Data Analytics especially in Healthcare</li>\n<li>Supply Chain Management Application Development</li>\n<li>Social E-commerce App Development</li>\n<li>Securities Trading Solutions Development</li>\n<li>SurroundCore Banking Solutions Development</li>\n</ul>\n<h3>Contact</h3>\n<p>Email: <a href=\"mailto:recruitment@elarion.com\">recruitment@elarion.com</a></p>\n          </td>\n        </tr>\n      </tbody>\n    "], "569": ["IT Consultis - Senior AWS DevOps Engineer - Saigon - FT", "Jun 1, 2017", "https://github.com/awesome-jobs/vietnam/issues/569", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Saigon, Vietnam</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>From 1500 to 2500 USD/month</li>\n</ul>\n<h2>Requirement</h2>\n<ul>\n<li>Bachelor&rsquo;s Degree in Computer Science or equivalent experience in the software development field</li>\n<li>5+ years of software development experience with a minimum of 3+ years developing using Node.js and AWS services</li>\n<li>Disciplined approach to software development. Includes defining and enforcing engineering best practices</li>\n<li>Experience reviewing and updating requirements and/or user stories</li>\n<li>Experience writing technical documentation</li>\n<li>Understanding of agile software development</li>\n</ul>\n<h2>Skills</h2>\n<h3>Must have</h3>\n<ul>\n<li>Expert knowledge of Node.js, Java, bash scripting</li>\n<li>Expert knowledge of Amazon AWS services focusing on DynamoDB, Kinesis, S3, Redis, Elasticsearch</li>\n<li>Experience with Akamai CDN solution</li>\n<li>Experience working with Jenkins for CI and CD</li>\n<li>Experience working with RESTful API type web services</li>\n<li>Experience in developing applications leveraging XML/JSON</li>\n<li>Solid understanding of Data Modeling</li>\n<li>Strong technical, problem-solving, analytical, communication and interpersonal skills</li>\n<li>Demonstrated ability to work on diverse projects requiring detailed analysis, creative/practical problem solving, time management and logical judgment</li>\n<li>Understanding of importance of maintainable / sustainable product solutions</li>\n<li>Experience in working with third-party libraries and APIs</li>\n<li>Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies</li>\n<li>Solid understanding of the full application development life cycle</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>A working knowledge of Docker and related technologies</li>\n<li>Working experience in developing solutions used for mobile applications</li>\n<li>Amazon AWS certifications</li>\n<li>Knowledge of Aliyun services</li>\n<li>Understanding of Automated testing</li>\n<li>Well-versed and active user of GitHub</li>\n</ul>\n<h3>Responsibilities</h3>\n<p>You will be:</p>\n<ul>\n<li>Accountable for designing and building advanced applications using the Amazon Web Services ecosystem</li>\n<li>Leading team to deliver and execute on a project</li>\n<li>Analyzing user stories and participating in sprint planning, scrums, demos and retrospectives</li>\n<li>Accountable for uptime and high-availability for all solutions</li>\n<li>Accountable for performance and usability in all solutions</li>\n<li>Accountable for working with outside data sources and APIs</li>\n<li>Coordinating with Architect team on new designs and foundational / infrastructural application changes</li>\n<li>Collaborating with cross-functional teams to define, design, and ship new features</li>\n<li>Integrating back-end services</li>\n<li>Understanding the need for optimized / customized mobile service responses / payloads</li>\n<li>Accountable for Unit-test code for robustness, including edge cases, usability, and general reliability</li>\n<li>Accountable for working on bug fixing and improving application performance</li>\n<li>Ensuring the performance, quality, and responsiveness of applications</li>\n<li>Accountable for maintaining code quality, organization and automatization</li>\n<li>Accountable for continuously discovering, evaluating, and implementing new technologies to optimize development efficiency</li>\n<li>Learning new technologies when required</li>\n<li>Performing peer code reviews for immediate and related teams</li>\n<li>Understanding of continuous integration / continuous delivery concepts and the ability to troubleshoot related issues</li>\n<li>Assisting the QA team with new product releases and bug fixes for products</li>\n<li>Providing architectural direction on behalf of the architect</li>\n<li>Providing estimates for new initiatives</li>\n<li>Communicating long-term technical strategies to the group</li>\n</ul>\n<h3>You can bring:</h3>\n<ul>\n<li>Excellent written, verbal and interpersonal English communication skills. The position requires frequent communication with colleagues and in several different geographic locations and time zones</li>\n<li>Proven ability to work with all members of an extended and diverse project team</li>\n<li>Must be detail-oriented, self-organized, be committed to quality and be capable of tracking multiple issues simultaneously</li>\n<li>Capability of mentoring and guidance skills to provide oversight and direction to contractors and junior members of the team</li>\n<li>Excellent time management skills</li>\n<li>Confidence and ability to perform effectively and make decisions with minimal management oversight</li>\n<li>Ability and desire to effectively mentor others and contribute to a collaborative team environment</li>\n</ul>\n<h3>Why it would be awesome to work with us:</h3>\n<ul>\n<li>ITC welcome package</li>\n<li>ITC athlete program</li>\n<li>Soft skills improvements</li>\n<li>Expert sharing sessions</li>\n<li>Career development and evolution</li>\n<li>Onboarding and mentoring</li>\n</ul>\n<h3>Interesting Engineering Projects:</h3>\n<ul>\n<li>New mobile app and already leading the market in Shanghai and ready to scale up globally! The ground-breaking App focuses on bringing a community of fashion lovers together. Users get inspirations from the community about outfits. They can also improve their own style and receive or give feedback to others.</li>\n<li>Working on this project is a fantastic opportunity to participate in something that will be one of the new unicorns.</li>\n</ul>\n<h3>Contact:</h3>\n<ul>\n<li>Homepage: <a href=\"https://it-consultis.com\">https://it-consultis.com</a></li>\n<li>Email: <a href=\"mailto:ninh.nguyen@it-consultis.com\">ninh.nguyen@it-consultis.com</a></li>\n</ul>\n          </td>\n        </tr>\n      </tbody>\n    "], "580": ["HoviTeam - Javascript Developer - Remote/Saigon - C", "Jun 8, 2017", "https://github.com/awesome-jobs/vietnam/issues/580", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Saigon, Vietnam</li>\n<li>Remote</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>Negotiable</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>2+ years Javascript experience</li>\n<li>Degree in Computer Science, Software Engineering or a related subject is preferred</li>\n</ul>\n<h2>Skills</h2>\n<h3>Must Have</h3>\n<ul>\n<li>2+ years Javascript experience</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>2+ years Javascript experience</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Build a javascript module about sheet music</li>\n<li>Input is a musicxml format, also maybe another format which my team will define. You will parse this format and draw it into sheet music. Besides, you will use soundfont to play that sheet music with cursor moving on it. Moreover, you also draw piano keyboard and active these keys follow the sheet music.</li>\n</ul>\n<h3>Interesting Engineering Projects</h3>\n<ul>\n<li>The team is building musical platform for the person is learning piano</li>\n<li>They can listen the sheet music with the cursor moving on the sheet music, and activated piano's keyboard</li>\n<li>They also can convert the sheet music to pdf, midi</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>You have a chance to learn about piano music</li>\n<li>You can understand sheet music</li>\n<li>We are both musician and developer, so, you will easily to discuss with us.</li>\n</ul>\n<h3>Contact</h3>\n<p>Email: <a href=\"mailto:hoviteam07@gmail.com\">hoviteam07@gmail.com</a></p>\n          </td>\n        </tr>\n      </tbody>\n    "], "558": ["Dinosys - Front-end Developer - HCM - FT", "May 24, 2017", "https://github.com/awesome-jobs/vietnam/issues/558", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<p>Founded by a group of seasoned IT professionals, Dinosys is an innovator in the business of designing, integrating and managing world-class technology products and solutions. Our founders realized the power of digitalization in providing solutions to businesses with pressing challenges and exciting opportunities in today&rsquo;s increasingly interconnected world. Specialized in system integration, software development and outsourcing, Dinosys is striving to become a leading ICT company in Vietnam and Southeast Asia. Combining unrivalled experience across many industries and business functions, and extensive relationship with the world&rsquo;s biggest technology companies, Dinosys partners with clients to help develop capabilities, drive performance improvements and achieve enduring successes.</p>\n<ul>\n<li>204 Pasteur, Ward 6, Distrist 3</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>Competive</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Minimum 1-3 year commercial experience with HTML5, JavaScript, CSS or other web technologies</li>\n<li>Strong JavaScript and AngularJS skills. Experience with Angular 2 or TypeScript is a plus</li>\n<li>Experience building responsive web apps</li>\n<li>Strong analytical and problem solving abilities</li>\n<li>Strong communication and client facing skills</li>\n</ul>\n<h2>Skills</h2>\n<ul>\n<li>Strong JavaScript and AngularJS skills</li>\n</ul>\n<h3>Must Have</h3>\n<ul>\n<li>Minimum 1-3 year commercial experience with HTML5, JavaScript, CSS or other web technologies</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>Experience building responsive web apps</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Front-end Mobile Web development (HTML5, CSS3, Angular 2, integration with RESTful Web API)</li>\n<li>Maintain existing software</li>\n<li>Constantly learn and keep abreast of emerging technologies</li>\n<li>Contribute to the software design processes including whiteboarding sessions, workshops and prototyping</li>\n<li>Critique software designs and architectures</li>\n<li>Peer review colleagues code and identify areas for improvement</li>\n<li>Provide development task effort estimates</li>\n<li>Conduct client requirements gathering and analysis</li>\n<li>Review test plans</li>\n<li>Follow defined development best practice including commenting and documenting code, contribute to development wikis and using source control</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>\n<p>Come and work with us. You will have opportunity to learn new technologies with international standard, build products that are different/innovative and get various benefits:</p>\n</li>\n<li>\n<p>Working in dynamic invironment, young, professional and fast growing</p>\n</li>\n<li>\n<p>Laptop is provided</p>\n</li>\n<li>\n<p>12 days annual leaves, working Monday - Friday, flexible working time</p>\n</li>\n<li>\n<p>Salary review 2 times/ year</p>\n</li>\n<li>\n<p>Free parking for your bike</p>\n</li>\n<li>\n<p>Employee Benefits: Social insurance, Health insurance.</p>\n</li>\n<li>\n<p>Unemployment insurance and Sick leave: based on current relevant Laws</p>\n</li>\n<li>\n<p>Team building monthly</p>\n</li>\n<li>\n<p>Training new technology frequently</p>\n</li>\n</ul>\n<h3>Interesting Projects</h3>\n<ul>\n<li>We use international standard in building system such as agile, test driven development, continuous integration and continuous deployment.</li>\n<li>You will be trained and apply new technologies such as Go, Elixir,.. or new frameworks: Hanami, Phoenix,...</li>\n</ul>\n<h3>Contact</h3>\n<p>Email: <a href=\"mailto:oanh.tang@dinosys.vn\">oanh.tang@dinosys.vn</a><br/>\nPhone: 0909 617 173<br/>\nSkype: tangoanh<br/>\nFB: <a href=\"https://www.facebook.com/oanhtang195\">https://www.facebook.com/oanhtang195</a><br/>\nWebsite: <a href=\"https://dinosys.vn/joinus/\">https://dinosys.vn/joinus/</a></p>\n          </td>\n        </tr>\n      </tbody>\n    "], "600": ["Dinosys - Senior Ruby on Rails Developer - HCM - FT", "Jul 3, 2017", "https://github.com/awesome-jobs/vietnam/issues/600", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>204 Pasteur, Ward 6, Distrist 3</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>Competive</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Ruby on Rails</li>\n<li>Grape API</li>\n<li>PostgreSQL</li>\n<li>Apache, Nginx, Passenger, Docker, Sidekiq</li>\n<li>Centos for deployment</li>\n</ul>\n<h2>Skills</h2>\n<p>Strong Ruby on Rails and Server set up</p>\n<h3>Must Have</h3>\n<ul>\n<li>Experience writing tests with RSpec/MiniTest and doing Continuous Integration is a plus</li>\n<li>Experience working with relational database (PostgreSQL)</li>\n<li>Experience with building beautiful and efficient APIs</li>\n<li>Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3</li>\n<li>Solid understanding of object-oriented programming</li>\n<li>Strong analytical and problem solving abilities</li>\n<li>Strong communication and client facing skills</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>Experience with Ruby on Rails or Grape API</li>\n<li>Experience setting up servers (nginx etc.) and automating deployment process (Docker, Ansible, Chef etc.)</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, build, and maintain efficient, reusable, and reliable Ruby code</li>\n<li>Integration of data storage solutions</li>\n<li>Help maintain code quality, organization and automatization</li>\n<li>Constantly learn and keep abreast of emerging technologies</li>\n<li>Contribute to the software design processes including whiteboarding sessions, workshops and prototyping</li>\n<li>Critique software designs and architectures</li>\n<li>Peer review colleagues code and identifying areas for improvement</li>\n<li>Provide development task effort estimates</li>\n<li>Conduct client requirements gathering and analysis</li>\n<li>Review test plans</li>\n<li>Follow defined development best practice including commenting and documenting code, contribute to development wikis and using source control</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>\n<p>Come and work with us. You will have opportunity to learn new technologies with international standard, build products that are different/innovative and get various benefits:</p>\n</li>\n<li>\n<p>Working in dynamic invironment, young, professional and fast growing</p>\n</li>\n<li>\n<p>Laptop is provided</p>\n</li>\n<li>\n<p>12 days annual leaves, working Monday - Friday, flexible working time</p>\n</li>\n<li>\n<p>Salary review min 1 times/ year</p>\n</li>\n<li>\n<p>Free parking for your bike</p>\n</li>\n<li>\n<p>Employee Benefits: Social insurance, Health insurance.</p>\n</li>\n<li>\n<p>Unemployment insurance and Sick leave: based on current relevant Laws</p>\n</li>\n<li>\n<p>Team building monthly</p>\n</li>\n<li>\n<p>Training new technology frequently</p>\n</li>\n</ul>\n<h3>Interesting engineering projects</h3>\n<ul>\n<li>We use international standard in building system such as agile, test driven development, continuous integration and continuous deployment.</li>\n<li>You will be trained and apply new technologies such as Go, Elixir,.. or new frameworks: Hanami, Phoenix,...</li>\n</ul>\n<h3>Contact</h3>\n<p>Email: <a href=\"mailto:oanh.tang@dinosys.vn\">oanh.tang@dinosys.vn</a><br/>\nPhone: 0909 617 173<br/>\nSkype: tangoanh<br/>\nFB: <a href=\"https://www.facebook.com/oanhtang195\">https://www.facebook.com/oanhtang195</a><br/>\nWebsite: <a href=\"https://dinosys.vn/joinus/\">https://dinosys.vn/joinus/</a></p>\n          </td>\n        </tr>\n      </tbody>\n    "], "579": ["honestbee - Senior / Lead Backend Developer - Saigon - FT", "Jun 8, 2017", "https://github.com/awesome-jobs/vietnam/issues/579", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Saigon, Vietnam</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>$1,800 - 2,700</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Ruby or Golang</li>\n<li>PostgreSQL</li>\n<li>Experience with building scalable system</li>\n<li>Experience with micro-service architecture</li>\n<li>5+ years Software Engineering experience</li>\n</ul>\n<h2>About honestbee</h2>\n<p>honestbee is a more than just a grocery delivery app. We are Asia's leading online concierge and delivery service for all your lifestyle needs. We take care of those time-consuming daily chores and create time for you to spend doing what you love and care about. With our technical expertise, data-fuelled operations and our network of partners, people experience how life&rsquo;s just easier with honestbee.</p>\n<h3>OUR VISION</h3>\n<p>The world&rsquo;s most convenient services marketplace.</p>\n<h3>OUR MISSION</h3>\n<p>Provide positive social and financial impact on the lives and businesses that we touch</p>\n<p>Three months at honestbee are like a year at any other company. Things move fast. You learn more, you accomplish more. Our teams come from a diverse range of cultures, giving us a competitive edge when working across SE Asia. We are looking for people who are excited about empowering communities as much as we are.</p>\n<p>Solving the riddles of e-Commerce and logistics. We work on practical solutions for the real world and we are obsessed about building a platform that awes and delights our customers - that&rsquo;s our commitment to them!</p>\n<p>Dare, try, do - we encourage our people to innovate from within and we will never ever stop experimenting and taking risks. If all that makes you buzz in excitement, come join our ambitious, strong-minded and determined team that takes both work and play seriously.</p>\n<h2>Skills</h2>\n<ul>\n<li>Prior experience working on developing payment gateways highly beneficial</li>\n<li>Experience with mentoring other team members</li>\n<li>Familiarity with TDD and BDD concepts and how to use them to write code that is well tested</li>\n<li>Experience working on the web stack and willing to get into the Rails stack.</li>\n<li>You enjoy working in a start-up and open environment</li>\n<li>You take pride and ownership in your work</li>\n<li>You are self-motivated and can work well under pressure</li>\n<li>You have a good sense of humor and like fun</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Helping to develop better architecture and establish ways for improving payment solutions</li>\n<li>Mentor and nurture more junior members of the team</li>\n<li>Work closely with product and design to build and improve features</li>\n<li>Write and improve upon existing code with attention paid to performance</li>\n<li>Plan and document technical specifications for features or system design</li>\n<li>Contribute towards improving engineering culture and approach</li>\n</ul>\n<h3>Interesting Engineering Projects</h3>\n<p>The team is building payment solution suite for the e-commerce solution:</p>\n<ul>\n<li>How to architect a money storage solution with transactional integrity? (race condition handling &amp; idempotency support)</li>\n<li>How to build automatic integration testing for multiple services architecture based on Docker?</li>\n<li>How to monitor fraudulent activity for a wallet? (by transaction activities, user information, etc)</li>\n</ul>\n<h3>Contact</h3>\n<p>Homepage: honestbee.com<br/>\nTrollman: <a href=\"mailto:ngoc.tran@honestbee.com\">ngoc.tran@honestbee.com</a> (+84937362841)</p>\n          </td>\n        </tr>\n      </tbody>\n    "], "581": ["Dinosys - Java Developer - HCM - FT", "Jun 8, 2017", "https://github.com/awesome-jobs/vietnam/issues/581", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<p>Founded by a group of seasoned IT professionals, Dinosys is an innovator in the business of designing, integrating and managing world-class technology products and solutions. Our founders realized the power of digitalization in providing solutions to businesses with pressing challenges and exciting opportunities in today&rsquo;s increasingly interconnected world. Specialized in system integration, software development and outsourcing, Dinosys is striving to become a leading ICT company in Vietnam and Southeast Asia. Combining unrivalled experience across many industries and business functions, and extensive relationship with the world&rsquo;s biggest technology companies, Dinosys partners with clients to help develop capabilities, drive performance improvements and achieve enduring successes.</p>\n<p>204 Pasteur, Ward 6, Distrist 3</p>\n<h2>Salary Expectation</h2>\n<ul>\n<li>$1000 - $1500/month</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Javascript</li>\n<li>Spring MVC</li>\n<li>Spring Boot</li>\n<li>Thymeleaf</li>\n<li>Maven</li>\n<li>Apache/Tomcat</li>\n<li>3+ years Java Spring Back-end experience</li>\n</ul>\n<h2>Skills</h2>\n<h3>Must Have</h3>\n<ul>\n<li>Working knowledge of Java Programming Language</li>\n<li>Working knowledge of JDBC, Hibernate, Spring MVC, Thymeleaf, Spring Boot</li>\n<li>Working knowledge of Javascript, JQuery</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>Experience with Maven or Gradle</li>\n<li>Experience with CSS, HTML5, web-/application-server (Apache/Tomcat), data modelling and SQL queries</li>\n<li>Very good communication skills</li>\n<li>The ability to work independently, responsibly, accurately and reliably</li>\n<li>Good English and computer skills</li>\n</ul>\n<h3>Responsibilities</h3>\n<h3>You&rsquo;ll be responsible for</h3>\n<ul>\n<li>Design and implement web-based applications</li>\n<li>Build the core frameworks for a high-scale web-services/microservices and RESTful APIs</li>\n<li>Maintain and develop the existing products</li>\n<li>Further development of software components</li>\n<li>Troubleshoot complex software systems under dynamic boundary constraints</li>\n<li>Provide document of software development</li>\n<li>Deploy and test software application</li>\n</ul>\n<h3>Why it would be awesome to work with us</h3>\n<ul>\n<li>\n<p>Come and work with us. You will have opportunity to learn new technologies with international standard, build products that are different/innovative and get various benefits:</p>\n</li>\n<li>\n<p>Working in dynamic invironment, young, professional and fast growing</p>\n</li>\n<li>\n<p>Laptop is provided</p>\n</li>\n<li>\n<p>12 days annual leaves, working Monday - Friday</p>\n</li>\n<li>\n<p>Salary review 2 times/ year</p>\n</li>\n<li>\n<p>Free parking for your bike</p>\n</li>\n<li>\n<p>Employee Benefits: Social insurance, Health insurance.</p>\n</li>\n<li>\n<p>Unemployment insurance and Sick leave: based on current relevant Laws</p>\n</li>\n<li>\n<p>Team building monthly</p>\n</li>\n<li>\n<p>Training new technology frequently</p>\n</li>\n</ul>\n<h3>Interesting Projects</h3>\n<ul>\n<li>We use international standard in building system such as agile, test driven development, continuous integration and continuous deployment.</li>\n<li>Project that you will build: 2 level tokenization for banking, Infrastructure management for public architecture of Singapore</li>\n</ul>\n<h3>Contact</h3>\n<p>Email: <a href=\"mailto:oanh.tang@dinosys.vn\">oanh.tang@dinosys.vn</a><br/>\nPhone: 0909 617 173<br/>\nSkype: tangoanh<br/>\nFB: <a href=\"https://www.facebook.com/oanhtang195\">https://www.facebook.com/oanhtang195</a><br/>\nWebsite: <a href=\"https://dinosys.vn/\">https://dinosys.vn/</a></p>\n          </td>\n        </tr>\n      </tbody>\n    "], "570": ["IT Consultis - Senior Android Application Developer - Saigon - FT", "Jun 1, 2017", "https://github.com/awesome-jobs/vietnam/issues/570", "\n      <tbody class=\"d-block\">\n        <tr class=\"d-block\">\n          <td class=\"d-block comment-body markdown-body js-comment-body\">\n              <h2>Location</h2>\n<ul>\n<li>Saigon, Vietnam</li>\n</ul>\n<h2>Salary Expectation</h2>\n<ul>\n<li>From 900 to 1800 USD/month</li>\n</ul>\n<h2>Requirement</h2>\n<ul>\n<li>Bachelor&rsquo;s Degree in Computer Science or equivalent experience in the software development field</li>\n<li>5+ years of software development experience with a minimum of 3+ years mobile application development experience</li>\n<li>Disciplined approach to software development. Includes defining and enforcing engineering best practices</li>\n<li>Experience reviewing and updating requirements and/or user stories</li>\n<li>Experience writing technical documentation</li>\n<li>Understanding of agile software development</li>\n</ul>\n<h2>Skills</h2>\n<h3>Must have</h3>\n<ul>\n<li>Expert knowledge of Java, Android IDEs, and Gradle</li>\n<li>Adept at building beautiful interfaces in concert with a strong, working understanding of data model management</li>\n<li>Experience working with RESTful API type web services</li>\n<li>Experience in developing applications leveraging XML/JSON</li>\n<li>Familiar with Rx</li>\n<li>Solid understanding of Data Modeling</li>\n<li>Solid understand of Multi-Threaded applications</li>\n<li>Shipped at least one app to the Play Store / other android store</li>\n<li>Strong technical, problem-solving, analytical, communication and interpersonal skills</li>\n<li>Demonstrated ability to work on diverse projects requiring detailed analysis, creative/practical problem solving, time management and logical judgment</li>\n<li>Familiar with Android design guidelines and best practices, especially Material Design</li>\n<li>Understanding of importance of maintainable / sustainable product solutions</li>\n<li>Experience in working with third-party libraries and APIs</li>\n<li>Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies</li>\n<li>Solid understanding of the full mobile development life cycle</li>\n</ul>\n<h3>Ideally</h3>\n<ul>\n<li>A working knowledge of JavaScript and WEB 2.0 applied in the context of Hybrid mobile development using frameworks such as PhoneGap or Cordova is big nice-to-have.</li>\n<li>Knowledge in web technologies such as HTML5 / CSS / JavaScript is an advantage</li>\n<li>Understanding of Automated testing</li>\n<li>Well-versed and active user of GitHub</li>\n</ul>\n<h3>Responsibilities</h3>\n<p>You will be:</p>\n<ul>\n<li>Accountable for designing and building advanced applications for the Android platform</li>\n<li>Leading team to deliver and execute on a project</li>\n<li>Analyzing user stories and participating in sprint planning, scrums, demos and retrospectives</li>\n<li>Accountable for uptime and high-availability for all solutions</li>\n<li>Accountable for performance and usability in all solutions</li>\n<li>Accountable for working with outside data sources and APIs</li>\n<li>Coordinating with Architect team on new designs and foundational / infrastructural application changes</li>\n<li>Collaborating with cross-functional teams to define, design, and ship new features</li>\n<li>Integrating mobile application code with back-end services</li>\n<li>Understanding the need for optimized / customized mobile service responses / payloads</li>\n<li>Accountable for Unit-test code for robustness, including edge cases, usability, and general reliability</li>\n<li>Accountable for working on bug fixing and improving application performance</li>\n<li>Ensuring the performance, quality, and responsiveness of applications</li>\n<li>Accountable for maintaining code quality, organization and automatization</li>\n<li>Accountable for continuously discovering, evaluating, and implementing new technologies to optimize development efficiency</li>\n<li>Learning new technologies when required</li>\n<li>Performing peer code reviews for immediate and related teams</li>\n<li>Understanding of continuous integration / continuous delivery concepts and the ability to troubleshoot related issues</li>\n<li>Assisting the QA team with new product releases and bug fixes for products</li>\n<li>Providing architectural direction on behalf of the architect team</li>\n<li>Providing estimates for new initiatives</li>\n<li>Communicating long-term technical strategies to the group</li>\n</ul>\n<h3>You can bring:</h3>\n<ul>\n<li>Excellent written, verbal and interpersonal English communication skills. The position requires frequent communication with colleagues and in several different geographic locations and time zones</li>\n<li>Proven ability to work with all members of an extended and diverse project team</li>\n<li>Must be detail-oriented, self-organized, be committed to quality and be capable of tracking multiple issues simultaneously</li>\n<li>Capability of mentoring and guidance skills to provide oversight and direction to contractors and junior members of the team</li>\n<li>Excellent time management skills</li>\n<li>Confidence and ability to perform effectively and make decisions with minimal management oversight</li>\n<li>Ability and desire to effectively mentor others and contribute to a collaborative team environment</li>\n</ul>\n<h3>Why it would be awesome to work with us:</h3>\n<ul>\n<li>ITC welcome package</li>\n<li>ITC athlete program</li>\n<li>Soft skills improvements</li>\n<li>Expert sharing sessions</li>\n<li>Career development and evolution</li>\n<li>Onboarding and mentoring</li>\n</ul>\n<h3>Interesting Engineering Projects:</h3>\n<ul>\n<li>New mobile app and already leading the market in Shanghai and ready to scale up globally! The ground-breaking App focuses on bringing a community of fashion lovers together. Users get inspirations from the community about outfits. They can also improve their own style and receive or give feedback to others.</li>\n<li>Working on this project is a fantastic opportunity to participate in something that will be one of the new unicorns.</li>\n</ul>\n<h3>Contact:</h3>\n<ul>\n<li>Homepage: <a href=\"https://it-consultis.com\">https://it-consultis.com</a></li>\n<li>Email: <a href=\"mailto:ninh.nguyen@it-consultis.com\">ninh.nguyen@it-consultis.com</a></li>\n</ul>\n          </td>\n        </tr>\n      </tbody>\n    "]}